Table of Contents
 Class IdeaPolyLine3D
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaPolyLine3D : AbstractIdeaObject<IIdeaPolyLine3D>, IEquatable<AbstractIdeaObject<IIdeaPolyLine3D>>, IIdeaPolyLine3D, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaPolyLine3D>
IdeaPolyLine3D
Implements
IEquatable<AbstractIdeaObject<IIdeaPolyLine3D>>
IIdeaPolyLine3D
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaPolyLine3D>.Id
 AbstractIdeaObject<IIdeaPolyLine3D>.Name
 AbstractIdeaObject<IIdeaPolyLine3D>.Identifier
 AbstractIdeaObject<IIdeaPolyLine3D>.GetHashCode()
 AbstractIdeaObject<IIdeaPolyLine3D>.Equals(object)
 AbstractIdeaObject<IIdeaPolyLine3D>.Equals(AbstractIdeaObject<IIdeaPolyLine3D>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaPolyLine3D(Identifier<IIdeaPolyLine3D>)
public IdeaPolyLine3D(Identifier<IIdeaPolyLine3D> identifer)
Parameters
identifer Identifier<IIdeaPolyLine3D>
 IdeaPolyLine3D(int)
public IdeaPolyLine3D(int id)
Parameters
id int
 IdeaPolyLine3D(string)
public IdeaPolyLine3D(string id)
Parameters
id string
Properties
 Segments
Gets the segments contained by the polygon
public virtual List<IIdeaSegment3D> Segments { get; set; }
Property Value
List<IIdeaSegment3D>
 Edit this page